app/Http/Controllers/BillKindController.php

select * from `branch`
---
    public function show(Request $request)
    {

        $this->validate($request, [
            'datenew' => 'required',
            'endtime' => 'required'
        ]);

        $branches = branch::all();

        return view('POS.billsNumber')->with([
            'branches'  => $branches,
            'startDate' => $request->input('datenew'),
            'endDate'   => $request->input('endtime')
        ]);