app/Http/Controllers/billsDailyController.php

    public function index()
    {
        $branches = branch::all();
        $users = Rest_User::all();
---
select * from `Rest_User`

    public function show(Request $request)
    {
        $this->validate($request, [

            'startdate' => 'required',
            'enddate' => 'required'
        ]);

        $startdate = Carbon::parse($request->startdate)->startOfDay()->toDateTimeString();
        $enddate = Carbon::parse($request->enddate)->endOfDay()->toDateTimeString();
        $branches = branch::find($request->branch);
        $users = Rest_User::find($request->users);
        if (empty($branch) && !empty($users)) {
            $orders =  orders::whereBetween('Date', [$startdate, $enddate])->join('billkind', 'orders.billkind', '=', 'billkind.billkind')
                //->where('branch_id', '=',$branch->branch_id)
                ->where('UserGuid', '=', $users->Guid)
                ->Orderby('Number')->get();
            $branches = branch::all();
            $users = Rest_User::all();
            return view('POS.billsDaily', compact('orders', 'branches', 'users'));
        } else if (empty($users) && !empty($branch)) {
            $orders =  orders::whereBetween('Date', [$startdate, $enddate])->join('billkind', 'orders.billkind', '=', 'billkind.billkind')
                ->where('branch_id', '=', $branch->branch_id)
                //->where('UserGuid', '=',$users->Guid)
                ->Orderby('Number')->get();
            $branches = branch::all();
            $users = Rest_User::all();
---
select * from `branch`

                //->where('UserGuid', '=',$users->Guid)
                ->Orderby('Number')->get();
            $branches = branch::all();
            $users = Rest_User::all();
---
select * from `Rest_User`