app/Http/Controllers/DetSalController.php

    public function show(Request $request)
    {
        $this->validate($request, [
            'datenew' => 'required',
            'endtime' => 'required'
        ]);

        $branches = branch::all();
        return view('POS.DetSal')->with([
                'branches'  => $branches,
                'startDate' => $request->input('datenew'),
                'endDate'   => $request->input('endtime')
            ]);
---
select * from `branch`