app/Http/Controllers/matsElementConsumingController.php

    public function show(Request $request)
    {
        $this->validate($request, [
            'datenew' => 'nullable',
            'endtime' => 'nullable'
        ]);

        $startDate = Carbon::parse($request->datenew)->startOfDay()->toDateTimeString();
        $endDate = Carbon::parse($request->endtime)->endOfDay()->toDateTimeString();
        //$branches = branch::find($request->branch);
        $branches = branch::all();

        // $materials = orderdetails::select('mats.Name1')
        // ->selectRaw("sum(orderdetails.Qty) as Qty")
        // ->leftJoin('mats', 'mats.Guid', '=', 'orderdetails.MatGuid')
        // ->leftJoin('orders', 'orders.Guid', '=', 'orderdetails.OrderGuid')
        // ->whereBetween('orders.Date',[$startDate,$endDate])
        // ->groupBy('mats.Name1')
        // ->get();

        $materials = MatDetails::select('matselements.Name', 'matdetails.Qty')
            ->selectRaw("sum(orderdetails.Qty) as Qtyo")
            ->join('mats', 'mats.Guid', '=', 'matdetails.MatGuid')
            ->join('matselements', 'matselements.Guid', '=', 'matdetails.MatElementGuid')
            ->join('orderdetails', 'orderdetails.MatGuid', '=', 'matdetails.MatGuid')
            ->join('orders', 'orders.Guid', '=', 'orderdetails.OrderGuid')
            ->whereBetween('orders.Date', [$startDate, $endDate])
            ->groupBy('matselements.Name', 'matdetails.Qty')
            ->get();
---
select `matselements`.`Name`, `matdetails`.`Qty`, sum(orderdetails.Qty) as Qtyo from `matdetails` inner join `mats` on `mats`.`Guid` = `matdetails`.`MatGuid` inner join `matselements` on `matselements`.`Guid` = `matdetails`.`MatElementGuid` inner join `orderdetails` on `orderdetails`.`MatGuid` = `matdetails`.`MatGuid` inner join `orders` on `orders`.`Guid` = `orderdetails`.`OrderGuid` where `orders`.`Date` between '2021-01-19 00:00:00' and '2021-01-19 23:59:59' group by `matselements`.`Name`, `matdetails`.`Qty`

        // $materials = $materials->MatDetails()->first();
        // dd($materials);
        $branches = branch::all();
        return view('POS.matElementsConsuming')->with([
                'x' => 1,
                'branches'  => $branches,
                'materials' => $materials,
                'startDate' => $request->input('datenew'),
                'endDate'   => $request->input('endtime')
            ]);
---
select * from `branch`