app/Http/Controllers/repoMatsSaleController.php

    public function index()
    {
        $branches = branch::all();
        $users = Rest_User::all();
---
select * from `Rest_User`