app/Http/Controllers/sellingLesseItemsController.php

    public function show(Request $request)
    {
        $this->validate($request, [
            'datenew' => 'required',
            'endtime' => 'required'
        ]);

        $startDate = Carbon::parse($request->datenew)->startOfDay()->toDateTimeString();
        $endDate = Carbon::parse($request->endtime)->endOfDay()->toDateTimeString();
        $branches = branch::find($request->branch);
        //$branches = branch::all();

        $materials = orderdetails::select('mats.Name1')
            ->selectRaw("sum(orderdetails.Qty) as Qty")
            ->leftJoin('mats', 'mats.Guid', '=', 'orderdetails.MatGuid')
            ->leftJoin('orders', 'orders.Guid', '=', 'orderdetails.OrderGuid')
            ->whereBetween('orders.Date', [$startDate, $endDate])
            ->groupBy('mats.Name1')
            ->get();
        $branches = branch::all();
---
select `mats`.`Name1`, sum(orderdetails.Qty) as Qty from `orderdetails` left join `mats` on `mats`.`Guid` = `orderdetails`.`MatGuid` left join `orders` on `orders`.`Guid` = `orderdetails`.`OrderGuid` where `orders`.`Date` between '2021-01-19 00:00:00' and '2021-01-19 23:59:59' group by `mats`.`Name1`
select * from `branch`